# Есть строка с перечислением фильмов

my_favorite_movies = 'Терминатор, Пятый элемент, Аватар, Чужие, Назад в будущее'

# Выведите на консоль с помощью индексации строки, последовательно:
#   первый фильм
#   последний
#   второй
#   второй с конца

# Переопределять my_favorite_movies и использовать .split() нельзя.
# Запятая не должна выводиться.

print(
my_favorite_movies.split(',')[0],
my_favorite_movies.split(',')[-1],
my_favorite_movies.split(',')[1],
my_favorite_movies.split(',')[-2],
)
